#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.igsr5_debug_server_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4116799354]
aws_key_pair.igsr5_debug_server_key_pair: Refreshing state... [id=igsr5_debug_server]
module.igsr5_debug_server_sg_80.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2964205250]
module.igsr5_debug_server_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3862433370]
aws_ssm_parameter.igsr5_time_management_slack_bot_user_oauth_token: Refreshing state... [id=/igsr5/time_management_slack/bot_user_oauth_token]
module.igsr5_debug_server_sg_80.aws_security_group.default: Refreshing state... [id=sg-040051f19452d7214]
module.igsr5_debug_server_sg.aws_security_group.default: Refreshing state... [id=sg-0f15df175478bf578]
module.igsr5_debug_server_sg_80.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1863532090]
aws_cloudfront_distribution.igsr5: Refreshing state... [id=E1RBGUKSCTYFWY]
aws_vpc.igsr5: Refreshing state... [id=vpc-0864c7ab6ca1d76a0]
aws_s3_bucket.igsr5_images: Refreshing state... [id=igsr5-images]
aws_key_pair.igsr5_gmo_practice_server: Refreshing state... [id=igsr5_gmo_practice_server]
aws_cloudwatch_log_group.prod_time_management_bolt: Refreshing state... [id=/ecs/igsr5/prod/time_management_bolt]
aws_ssm_parameter.igsr5_time_management_slack_dsn: Refreshing state... [id=/igsr5/time_management_slack/dsn]
aws_cloudfront_origin_access_identity.static-www: Refreshing state... [id=E13K0L3OQEMWND]
aws_ecr_repository.igsr5: Refreshing state... [id=igsr5]
aws_ecs_cluster.igsr5: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:cluster/igsr5]
aws_ssm_parameter.igsr5_time_management_slack_app_token: Refreshing state... [id=/igsr5/time_management_slack/app_token]
aws_db_option_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_name: Refreshing state... [id=/igsr5/time_management_slack/auth_user_name]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_id: Refreshing state... [id=/igsr5/time_management_slack/auth_user_id]
aws_db_parameter_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_cloudwatch_log_group.prod_time_management_go: Refreshing state... [id=/ecs/igsr5/prod/time_management_go]
aws_ssm_parameter.igsr5_time_management_slack_signing_secret: Refreshing state... [id=/igsr5/time_management_slack/signing_secret]
aws_s3_bucket.athena: Refreshing state... [id=athena-igsr5]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-igsr5]
module.ecs_task_execution_role.aws_iam_role.default: Refreshing state... [id=ecs-task-execution]
aws_ecr_lifecycle_policy.igsr5: Refreshing state... [id=igsr5]
aws_ecs_task_definition.igsr5_time_management_slack: Refreshing state... [id=igsr5_time_management_slack]
module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::799705073177:policy/ecs-task-execution]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20211124131639569600000001]
aws_subnet.igsr5_public_0: Refreshing state... [id=subnet-0176f59801ec25c61]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-03790c62086c12f18]
aws_subnet.igsr5_private_1: Refreshing state... [id=subnet-0411fd95b0c41875f]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-083f2270afd84b519]
aws_subnet.igsr5_private_0: Refreshing state... [id=subnet-091453d20102a88ad]
module.mysql_sg.aws_security_group.default: Refreshing state... [id=sg-0002d9a5dda871298]
aws_route_table.igsr5_private: Refreshing state... [id=rtb-061509f2bc59e6ed4]
aws_route_table.igsr5_public: Refreshing state... [id=rtb-0e2514394e6106643]
aws_subnet.igsr5_public_1: Refreshing state... [id=subnet-0978a0caf7b26a82f]
aws_internet_gateway.igsr5: Refreshing state... [id=igw-0bccf539544601095]
module.vpc_endpoint_sg.aws_security_group.default: Refreshing state... [id=sg-017d47677fcdff7a6]
module.ssh_sg.aws_security_group.default: Refreshing state... [id=sg-0bb0b7b3a437b6b53]
module.time_management_slack_sg.aws_security_group.default: Refreshing state... [id=sg-0cde50fa76f677bf0]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-818754843]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2425059150]
module.mysql_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2767102]
module.mysql_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4064317122]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-753097682]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1166082613]
aws_db_subnet_group.igsr5: Refreshing state... [id=igsr5]
aws_route_table_association.igsr5_private_1: Refreshing state... [id=rtbassoc-0b900a3894d983faf]
aws_route_table_association.igsr5_private_0: Refreshing state... [id=rtbassoc-0d89bb588ab1575e3]
aws_instance.igsr5_debug_server: Refreshing state... [id=i-01523047055773e58]
aws_instance.igsr5_gmo_practice_server: Refreshing state... [id=i-03e7c26606fe28b9e]
aws_route_table_association.igsr5_public_0: Refreshing state... [id=rtbassoc-07c598e12997c883b]
aws_route.igsr5_public: Refreshing state... [id=r-rtb-0e2514394e61066431080289494]
aws_route_table_association.igsr5_public_1: Refreshing state... [id=rtbassoc-09e062f160e685898]
module.vpc_endpoint_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-4230927273]
module.vpc_endpoint_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3638854328]
module.ssh_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2082516004]
module.ssh_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2018751517]
module.time_management_slack_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3983031859]
module.time_management_slack_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-280917491]
aws_ecs_service.igsr5_time_management_slack: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:service/igsr5/igsr5_time_management_slack]
aws_cloudfront_distribution.igsr5_images: Refreshing state... [id=E1XAVJF6X91WJL]
aws_s3_bucket_policy.igsr5_images: Refreshing state... [id=igsr5-images]
aws_db_instance.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_route53_record.igsr5_images: Refreshing state... [id=Z10382141794HJUVL4L9O_images.igsr5.com_A]
aws_lb.igsr5: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:loadbalancer/app/igsr5/e9df5a8fcd5a55c4]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-igsr5]
aws_route53_record.igsr5_sandbox_muson: Refreshing state... [id=Z10382141794HJUVL4L9O_sandbox_muson.igsr5.com_A]
aws_route53_record.igsr5: Refreshing state... [id=Z10382141794HJUVL4L9O_igsr5.com_A]
aws_acm_certificate.igsr5: Refreshing state... [id=arn:aws:acm:ap-northeast-1:799705073177:certificate/93205524-ee35-4db3-a2ec-178c97088452]
aws_route53_record.igsr5_certificate: Refreshing state... [id=Z10382141794HJUVL4L9O__3c5d11fe36cb523dbbd728056ce3e7e9.igsr5.com._CNAME]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:listener/app/igsr5/e9df5a8fcd5a55c4/116a88c60b6c915b]
aws_acm_certificate_validation.igsr5: Refreshing state... [id=2021-12-05 06:06:57 +0000 UTC]
aws_lb_listener_rule.igsr5_sandbox_muson: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:listener-rule/app/igsr5/e9df5a8fcd5a55c4/116a88c60b6c915b/5428e8687e4ec6b6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_db_instance.igsr5_sandbox has changed
  ~ resource "aws_db_instance" "igsr5_sandbox" {
        id                                    = "igsr5-sandbox"
      ~ latest_restorable_time                = "2022-04-08T06:35:00Z" -> "2022-04-08T08:05:00Z"
        tags                                  = {}
        # (46 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_instance.igsr5_debug_server will be updated in-place
  ~ resource "aws_instance" "igsr5_debug_server" {
        id                                   = "i-01523047055773e58"
        tags                                 = {
            "Name" = "igsr5-debug"
        }
      ~ vpc_security_group_ids               = [
          - "sg-040051f19452d7214",
          - "sg-0f15df175478bf578",
        ] -> (known after apply)
        # (32 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_instance.igsr5_gmo_practice_server will be updated in-place
  ~ resource "aws_instance" "igsr5_gmo_practice_server" {
        id                                   = "i-03e7c26606fe28b9e"
        tags                                 = {
            "Name" = "igsr5-gmo-practice-server"
        }
      ~ vpc_security_group_ids               = [
          - "sg-03790c62086c12f18",
          - "sg-0bb0b7b3a437b6b53",
        ] -> (known after apply)
        # (32 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.http_pub_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0864c7ab6ca1d76a0"
    }

  # module.http_pub_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_pub_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.igsr5_debug_server_sg.aws_security_group.default will be destroyed
  # (because aws_security_group.default is not in configuration)
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:799705073177:security-group/sg-0f15df175478bf578" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f15df175478bf578" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "igsr5-debug-server-sg" -> null
      - owner_id               = "799705073177" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0864c7ab6ca1d76a0" -> null
    }

  # module.igsr5_debug_server_sg.aws_security_group_rule.egress will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-4116799354" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0f15df175478bf578" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.igsr5_debug_server_sg.aws_security_group_rule.ingress will be destroyed
  # (because aws_security_group_rule.ingress is not in configuration)
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 22 -> null
      - id                = "sgrule-3862433370" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0f15df175478bf578" -> null
      - self              = false -> null
      - to_port           = 22 -> null
      - type              = "ingress" -> null
    }

  # module.igsr5_debug_server_sg_80.aws_security_group.default will be destroyed
  # (because aws_security_group.default is not in configuration)
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:799705073177:security-group/sg-040051f19452d7214" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-040051f19452d7214" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "igsr5-debug-server-sg-80" -> null
      - owner_id               = "799705073177" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0864c7ab6ca1d76a0" -> null
    }

  # module.igsr5_debug_server_sg_80.aws_security_group_rule.egress will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-2964205250" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-040051f19452d7214" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.igsr5_debug_server_sg_80.aws_security_group_rule.ingress will be destroyed
  # (because aws_security_group_rule.ingress is not in configuration)
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-1863532090" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-040051f19452d7214" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.ssh_pub_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ssh-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0864c7ab6ca1d76a0"
    }

  # module.ssh_pub_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ssh_pub_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 6 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @igsr5, Action: `pull_request`*